/* 
  Localizable.strings
  ownCloudSDK

  Created by Felix Schwarz on 03.03.18.
  Copyright © 2018 ownCloud GmbH. All rights reserved.
*/

/* Item property names */
"itemProperty.lastModified" = "Последнее изменение";
"itemProperty.isFavorite" = "В избранное";
"itemProperty.localAttributes" = "Локальные атрибуты";

/* Connection Progress */
"Connecting…" = "Соединение…";
"Authenticating…" = "Авторизация…";
"Error" = "Ошибка";
"Fetching user information…" = "Получение информации о пользователе…";
"Connected" = "Подключено";

"Retrieving thumbnail…" = "Получение миниатюр…";

"Cancel" = "Отмена";
"Proceed" = "Продолжить";
"OK" = "ОК";

/* Connection status */
"Offline" = "Нет сети";
"Offline (no WiFi connection)" = "Нет сети (нет соединения WiFi)";
"Server down for maintenance" = "Сервер не работает, находится на обслуживании";
"Online" = "В сети";

/* Delete */
"%@ changed on the server. Really delete it?" = "%@ изменилось на сервере. Действительно удалить?";
"%@ has changed on the server since you requested its deletion." = "%@ изменилось на сервер с того момента, как вы запросили его удаление.";
"Delete" = "Удалить";

"%@ couldn't be deleted" = "%@ удалить не удалось";
"Please check if you have sufficient permissions to delete %@." = "Пожалуйста, проверьте что у вас есть достаточные права для удаления %@.";

/* Copy / Move */
"Operation forbidden" = "Операция запрещена";
"%@ can't be copied to %@." = "%@ невозможно скопировать в %@.";
"%@ can't be moved to %@." = "%@ невозможно переместить в  %@.";

"%@ not found" = "%@ не найдено";
"%@ wasn't found at %@." = "%@ не найдено в %@.";

"The target directory %@ doesn't seem to exist." = "Похоже, целевой каталог %@ не существует.";

"%@ already exists" = "%@ уже существует";
"Couldn't copy %@ to %@, because an item called %@ already exists there." = "Не удалось скопировать %@ в %@, потому что элемент под названием %@ там уже существует.";
"Couldn't move %@ to %@, because an item called %@ already exists there." = "Не удалось переместить %@ в %@, потому что элемент под названием %@ уже существует.";

"Insufficient permissions" = "Недостаточно прав доступа";
"%@ can't be copied to %@." = "%@ невозможно скопировать в %@.";
"%@ can't be moved to %@." = "%@ невозможно переместить в  %@.";

"%@ not found on the server" = "%@ не найдено на сервере";
"%@ may have been renamed, moved or deleted remotely." = "%@ возможно было удалённо переименовано, перемещено или удалено.";

"Error copying %@" = "Ошибка при копировании %@";
"Error moving %@" = "Ошибка при перемещении %@";

/* Download */
"Downloading %@…" = "Скачивание %@…";

/* Move/Rename/Copy */
"Renaming %@ to %@…" = "Переименование %@ в %@…";
"Moving %@ to %@…" = "Перемещение %@ в %@…";
"Copying %@ to %@…" = "Копирование %@ в %@…";

/* Create folder */
"Creating folder %@…" = "Создание папки %@…";

/* Delete */
"Deleting %@…" = "Удаление %@…";

/* Retrieving file list */
"Retrieving file list for %@…" = "Получение списка файлов для %@…";

/* Update */
"\"%@\" metadata for %@ couldn't be updated" = "Не удалсоь обновить метаданные \"%@\" для %@";
"Update failed with status code %d" = "Обновление не прошло, код состояния %d";
"Error updating %@ metadata" = "Ошибка при обновлении метаданных %@";

/* Logging */
"Standard error output" = "Вывод на стандартную диагностику";
"Log file" = "Файл журнала";

/* Errors */
"Server doesn't seem to support any authentication method supported by this app." = "Похоже, сервер не поддерживает ни один из методов аутентификации, которые поддерживает данное приложение.";
"This server runs an unsupported version (%@). Version %@ or later is required by this app." = "На сервере работает неподдерживаемая версия (%@). Для данного приложения требуется версия  %@ или позже.";

/* DAV Errors */
// OCDAVErrorServiceUnavailable
"Server down for maintenance." = "Сервер не работает, находится на обслуживании.";

/* OC Errors */
"%@ (error %ld, %@)" = "%@ (ошибка %ld, %@)";
"%@ (error %ld)" = "%@ (ошибка %ld)";

// OCErrorInternal
"Internal error." = "Внутренняя ошибка.";

// OCErrorInsufficientParameters
"Insufficient parameters." = "Недостаточно параметров.";

// OCErrorAuthorizationFailed
"Authorization failed." = "Авторизация не прошла.";

// OCErrorAuthorizationRedirect
"Authorization failed because the server returned a redirect. Authorization may be successful when retried with the redirect URL." = "Авторизация не прошла, так как сервер вернул перенаправление. Авторизация может пройти успешно, если попробовать повторно с перенаправленной ссылкой.";

// OCErrorAuthorizationNoMethodData
"Authorization failed because no authorization data was set for the authentication method." = "Авторизация не прошла, так как для метода аутентификации не были заданы секретные данные.";

// OCErrorAuthorizationMissingData
"Authorization failed because data was missing from the secret data for the authentication method." = "Авторизация не прошла, так как не хватило части секретных данных для метода аутентификации.";

// OCErrroAuthorizationCancelled
"Authorization was cancelled by the user." = "Авторизация была отменена пользователем.";

// OCErrorRequestURLSessionTaskConstructionFailed
"Construction of URL Session Task failed." = "Формирование задачи ссылочного сеанса не прошло.";

// OCErrorNewerVersionExists
"A newer version already exists." = "Уже существует более свежая версия.";

// OCErrorRequestCancelled
"Request was cancelled." = "Запрос был отменён.";

// OCErrorRequestRemovedBeforeScheduling
"Request was removed before scheduling." = "Запрос был отменён до постановки на выполнение.";

// OCErrorRequestServerCertificateRejected
"Request was cancelled because the server certificate was rejected." = "Запрос был отменён, так как сертификат сервера был отклонён.";

// OCErrorRequestDroppedByURLSession
"Request was dropped by the NSURLSession." = "Запрос был отброшен NSURLSession.";

// OCErrorRequestCompletedWithError
"Request completed with error." = "Запрос завершился с ошибкой.";

// OCErrorRequestURLSessionInvalidated
"Request couldn't be scheduled because the underlying URL session has been invalidated." = "Не удалось поставить запрос на исполнение, так как нижележащий ссылочный сеанс был сброшен.";

// OCErrorException
"An exception occured." = "Произошло исключение.";

// OCErrorResponseUnknownFormat
"Response was in an unknown format." = "Ответ был в неизвестном формате.";

// OCErrorServerDetectionFailed
"Server detection failed, i.e. when the server at a URL is not an ownCloud instance." = "Не прошло определение сервера, то есть сервер по ссылке не является экземпляром ownCloud.";

// OCErrorServerTooManyRedirects
"Server detection failed because of too many redirects." = "Определение сервера не прошло из-за слишком большого количества перенаправлений.";

// OCErrorServerBadRedirection
"Server redirection to bad/invalid URL." = "Пенерапнавление сервера на плохую или недопустимую ссылку.";

// OCErrorServerVersionNotSupported
"This server version is not supported." = "Эта версия сервера не поддерживается.";

// OCErrorServerNoSupportedAuthMethods
"Server doesn't seem to support any authentication method supported by this app." = "Похоже, сервер не поддерживает ни один из методов аутентификации, которые поддерживает данное приложение.";

// OCErrorCertificateInvalid
"The certificate is invalid or contains errors" = "Сертификат неверен или содержит ошибки.";

// OCErrorCertificateMissing
"No certificate was returned for a request despite this being a HTTPS connection (should never occur in production, but only if you forgot to provide a certificate during simulated responses to HTTPS requests)." = "Не смотря на использование соединения HTTPS, для запроса не был получен сертификат (при эксплуатации такого быть не должно, только если вы забыли задать сертификат  при симуляции ответа на запрос HTTPS).";

// OCErrorFeatureNotSupportedForItem
"This feature is not supported for this item." = "Эта возможность не поддерживается для данного элемента.";

// OCErrorFeatureNotSupportedByServer
"This feature is not supported for this server (version)." = "Эта возможность не поддерживается для данного сервера (версия).";

// OCErrorFeatureNotImplemented
"This feature is currently not implemented" = "Эта возможность в настоящий момент не реализована";

// OCErrorItemNotFound
"The targeted item has not been found." = "Не найден указанный элемент.";

// OCErrorItemDestinationNotFound
"The destination item has not been found." = "Не найден целевой элемент.";

// OCErrorItemChanged
"The targeted item has changed." = "Указанный элемент изменился.";

// OCErrorItemInsufficientPermissions
"The action couldn't be performed on the targeted item because the client lacks permissions." = "Не удалось выполнить действие над указанным элементом, так как у клиента не хватает разрешений.";

// OCErrorItemOperationForbidden
"The operation on the targeted item is not allowed." = "Операция над указанным элементом не разрешена.";

// OCErrorItemAlreadyExists
"There already is an item at the destination of this action." = "В месте назначения этого действия уже есть элемент.";

// OCErrorItemNotAvailableOffline
"Item not available offline." = "Элемент не доступен без сети.";

// OCErrorFileNotFound:
"File not found." = "Файл не найден.";

// OCErrorCancelled
"The operation was cancelled." = "Операция была отменена.";

// OCErrorOutdatedCache
"An operation failed due to outdated cache information." = "Операция не прошла из-за устаревшей информации в кэше.";

// OCErrorRunningOperation
"A running operation prevents execution." = "Запуску мешает выполняемая операция.";
